import {ArticleMockI} from '../../components/arcitle/article';

export const useTermsMock: ArticleMockI = {
    title: 'Правила пользования',
    articles: [
        {
            id: '1',
            text: 'Идейные соображения высшего порядка, а также высокое качество позиционных исследований представляет собой интересный эксперимент проверки экспериментов, поражающих по своей масштабности и грандиозности.',
            subItems: [
                {
                    id: '1',
                    text: 'Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого участника как способного принимать собственные решения касаемо инновационных методов управления процессами.',
                },
                {
                    id: '2',
                    text: 'Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.',
                },
                {
                    id: '3',
                    text: 'Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.',
                },
                {
                    id: '4',
                    text: 'Но независимые государства, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут объединены в целые кластеры себе подобных.',
                },
            ],
        },
        {
            id: '2',
            text: 'С учётом сложившейся международной обстановки, консультация с широким активом предоставляет широкие возможности для приоритизации разума над эмоциями.',
            subItems: [
                {
                    id: '1',
                    text: 'Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого участника как способного принимать собственные решения касаемо инновационных методов управления процессами.',
                    subItems: [
                        {
                            id: '1',
                            text: 'Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.',
                        },
                        {
                            id: '2',
                            text: 'Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.',
                        },
                    ],
                },
                {
                    id: '2',
                    text: 'Но независимые государства, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут объединены в целые кластеры себе подобных.',
                }
            ],
        },
        {
            id: '3',
            text: 'Принимая во внимание показатели успешности, укрепление и развитие внутренней структуры требует от нас анализа приоритизации разума над эмоциями.',
            subItems: [
                {
                    id: '1',
                    text: 'Задача организации, в особенности же социально-экономическое развитие однозначно определяет каждого участника как способного принимать собственные решения касаемо инновационных методов управления процессами.',
                    subItems: [
                        {
                            id: '1',
                            text: 'Не следует, однако, забывать, что разбавленное изрядной долей эмпатии, рациональное мышление играет важную роль в формировании приоритизации разума над эмоциями. Но некоторые особенности внутренней политики лишь добавляют фракционных разногласий и преданы социально-демократической анафеме.',
                        },
                        {
                            id: '2',
                            text: 'Приятно, граждане, наблюдать, как элементы политического процесса, превозмогая сложившуюся непростую экономическую ситуацию, объявлены нарушающими общечеловеческие нормы этики и морали.',
                        }
                    ],
                },
                {
                    id: '2',
                    text: 'Но независимые государства, которые представляют собой яркий пример континентально-европейского типа политической культуры, будут объединены в целые кластеры себе подобных.'
                },
                {
                    id: '3',
                    text: 'Не следует, однако, забывать, что экономическая повестка сегодняшнего дня требует анализа анализа существующих паттернов поведения.',
                    subItems: [
                        {
                            id: '1',
                            text: 'А ещё представители современных социальных резервов набирают популярность среди определенных слоев населения, а значит, должны быть функционально разнесены на независимые элементы.',
                            subItems: [
                                {
                                    id: '1',
                                    text: 'Стремящиеся вытеснить традиционное производство, нанотехнологии могут быть объявлены нарушающими общечеловеческие нормы этики и морали.',
                                },
                                {
                                    id: '2',
                                    text: 'Прежде всего, разбавленное изрядной долей эмпатии, рациональное мышление однозначно фиксирует необходимость новых предложений. Являясь всего лишь частью общей картины, независимые государства представлены в исключительно положительном свете.',
                                }
                            ],
                        }
                    ],
                },
                {
                    id: '4',
                    text: 'Повседневная практика показывает, что убеждённость некоторых оппонентов требует от нас анализа распределения внутренних резервов и ресурсов.',
                }
            ],
        }
    ]
};
